squashfs-root/htdocs/web/hnap/SetFacebookWiFiSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<SetFacebookWiFiSettings xmlns="http://purenetworks.com/HNAP1/">
	<Enabled></Enabled>
	<guestzoneenable></guestzoneenable>
	<gwname></gwname>
	<gwvendorkey></gwvendorkey>
	<gwid></gwid>
	<gwsecret></gwsecret>
</SetFacebookWiFiSettings>
</soap:Body>
</soap:Envelope>